import os
from config import admin_id
from create_bot import dp, bot
from aiogram.types import Message
from aiogram import Dispatcher
from aiogram.dispatcher import FSMContext   # Указывает, что данный хендлер используется в Машине-состоянии
from aiogram.dispatcher.filters.state import State, StatesGroup
from aiogram.dispatcher.filters import Text
from data_base import sqlite_db
from keyboards import admin_kb



'''****************************************СЛУЖЕБНАЯ ЧАСТЬ***************************************************'''
'''*********************ЗАДАНИЯ***********************'''
async def send_to_admin(dp):
    print('Вывод служебной информации: подключение к БД и тп')
    try:
        await bot.send_message(chat_id=os.getenv('admin_id'), text="Бот запущен \n/start")
    except:
        await bot.send_message(chat_id=admin_id, text="Бот запущен \n/start")
'''^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^'''
'''*********************ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ*********************'''
# ID = None
'''**********************************************************************************************************'''

'''*******************************************ОСНОВНАЯ ЧАСТЬ*************************************************'''
'''*********************ФОРМА*************************'''
'''**********************************************************************************************************'''



'''***********************************ЗАПУСК ФУНКЦИЙ*********************************************************'''
# def register_message_admin(dp : Dispatcher):
'''**********************************************************************************************************'''